# Import library

In [69]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import StandardScaler

# Import dataset

In [13]:
dataset=pd.read_csv("C:/Users/MDTAN/OneDrive/Desktop/Grashtech.pvt.ltd/DAta set/old_car_data.csv")

# Show data file

In [61]:
dataset.head(5)

,car_name,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,car_prices_in_rupee
0,743,2351,1,1,1,2017,60,2,110
1,1444,491,4,0,1,2021,19,2,210
2,1706,1733,4,0,1,2016,88,2,302
3,385,820,4,0,1,2018,14,2,1110
4,1831,1929,4,1,1,2016,14,2,836

# Show the null value

In [15]:
dataset.isnull().sum()

car_name               0
kms_driven             0
fuel_type              0
transmission           0
ownership              0
manufacture            0
engine                 0
Seats                  0
car_prices_in_rupee    0
dtype: int64

# check the data type

In [16]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5512 entries, 0 to 5511
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   car_name             5512 non-null   object
 1   kms_driven           5512 non-null   object
 2   fuel_type            5512 non-null   object
 3   transmission         5512 non-null   object
 4   ownership            5512 non-null   object
 5   manufacture          5512 non-null   int64
 6   engine               5512 non-null   object
 7   Seats                5512 non-null   object
 8   car_prices_in_rupee  5512 non-null   object
dtypes: int64(1), object(8)
memory usage: 387.7+ KB

# Label data encoding

# car_name

In [18]:
from sklearn.preprocessing import LabelEncoder

In [62]:
car_name_le =LabelEncoder()

In [63]:
dataset["car_name"]=car_name_le.fit_transform(dataset["car_name"])

In [22]:
dataset.head(3)

,car_name,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,car_prices_in_rupee
0,743,"86,226 kms",Diesel,Manual,1st Owner,2017,1956 cc,5 Seats,10.03 Lakh
1,1444,"13,248 kms",Petrol,Automatic,1st Owner,2021,1330 cc,5 Seats,12.83 Lakh
2,1706,"60,343 kms",Petrol,Automatic,1st Owner,2016,2494 cc,5 Seats,16.40 Lakh

# kms_driven

In [ ]:
from sklearn.preprocessing import LabelEncoder

In [23]:
Kms_driven_le =LabelEncoder()

In [24]:
dataset["kms_driven"]= Kms_driven_le.fit_transform(dataset["kms_driven"])

In [25]:
dataset.head(3)

,car_name,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,car_prices_in_rupee
0,743,2351,Diesel,Manual,1st Owner,2017,1956 cc,5 Seats,10.03 Lakh
1,1444,491,Petrol,Automatic,1st Owner,2021,1330 cc,5 Seats,12.83 Lakh
2,1706,1733,Petrol,Automatic,1st Owner,2016,2494 cc,5 Seats,16.40 Lakh

# fuel_type

In [26]:
from sklearn.preprocessing import LabelEncoder

In [27]:
fuel_type_le=LabelEncoder()

In [28]:
dataset["fuel_type"]=fuel_type_le.fit_transform(dataset["fuel_type"])

In [29]:
dataset.head(3)

,car_name,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,car_prices_in_rupee
0,743,2351,1,Manual,1st Owner,2017,1956 cc,5 Seats,10.03 Lakh
1,1444,491,4,Automatic,1st Owner,2021,1330 cc,5 Seats,12.83 Lakh
2,1706,1733,4,Automatic,1st Owner,2016,2494 cc,5 Seats,16.40 Lakh

# transmission

In [30]:
from sklearn.preprocessing import LabelEncoder

In [31]:
transmission_le=LabelEncoder()

In [32]:
dataset["transmission"]=transmission_le.fit_transform(dataset["transmission"])

In [33]:
dataset.head(3)

,car_name,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,car_prices_in_rupee
0,743,2351,1,1,1st Owner,2017,1956 cc,5 Seats,10.03 Lakh
1,1444,491,4,0,1st Owner,2021,1330 cc,5 Seats,12.83 Lakh
2,1706,1733,4,0,1st Owner,2016,2494 cc,5 Seats,16.40 Lakh

# ownership

In [34]:
from sklearn.preprocessing import LabelEncoder

In [35]:
ownership_le= LabelEncoder()

In [36]:
dataset["ownership"]=ownership_le.fit_transform(dataset["ownership"])

In [37]:
dataset.head(3)

,car_name,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,car_prices_in_rupee
0,743,2351,1,1,1,2017,1956 cc,5 Seats,10.03 Lakh
1,1444,491,4,0,1,2021,1330 cc,5 Seats,12.83 Lakh
2,1706,1733,4,0,1,2016,2494 cc,5 Seats,16.40 Lakh

# engine

In [38]:
from sklearn.preprocessing import LabelEncoder

In [39]:
engine_le=LabelEncoder()

In [40]:
dataset["engine"]=engine_le.fit_transform(dataset["engine"])

In [41]:
dataset.head(3)

,car_name,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,car_prices_in_rupee
0,743,2351,1,1,1,2017,60,5 Seats,10.03 Lakh
1,1444,491,4,0,1,2021,19,5 Seats,12.83 Lakh
2,1706,1733,4,0,1,2016,88,5 Seats,16.40 Lakh

# Seats

In [42]:
from sklearn.preprocessing import LabelEncoder

In [43]:
Seats_le=LabelEncoder()

In [44]:
dataset["Seats"]=Seats_le.fit_transform(dataset["Seats"])

In [45]:

dataset.head(3)

,car_name,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,car_prices_in_rupee
0,743,2351,1,1,1,2017,60,2,10.03 Lakh
1,1444,491,4,0,1,2021,19,2,12.83 Lakh
2,1706,1733,4,0,1,2016,88,2,16.40 Lakh

# car_prices_in_rupee

In [46]:
from sklearn.preprocessing import LabelEncoder

In [47]:
car_prices_in_rupee_le=LabelEncoder()

In [48]:
dataset["car_prices_in_rupee"]=car_prices_in_rupee_le.fit_transform(dataset["car_prices_in_rupee"])

In [49]:
dataset.head(3)

,car_name,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,car_prices_in_rupee
0,743,2351,1,1,1,2017,60,2,110
1,1444,491,4,0,1,2021,19,2,210
2,1706,1733,4,0,1,2016,88,2,302

# get data from dataset

In [51]:
input_data = dataset.iloc[:,:-1]
output_data= dataset["car_prices_in_rupee"]
input_data.head(3)

,car_name,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats
0,743,2351,1,1,1,2017,60,2
1,1444,491,4,0,1,2021,19,2
2,1706,1733,4,0,1,2016,88,2

In [64]:
from sklearn.preprocessing import StandardScaler

In [65]:
ss= StandardScaler()

In [66]:
input_data = pd.DataFrame(ss.fit_transform(input_data),columns=input_data.columns)

In [67]:
input_data.head(5)

,car_name,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats
0,-0.336744,1.410944,-1.068243,0.625473,-0.599986,0.393228,0.159641,-0.35118
1,1.020841,-1.086913,0.918538,-1.598790,-0.599986,1.411657,-0.806498,-0.35118
2,1.528240,0.581011,0.918538,-1.598790,-0.599986,0.138621,0.819443,-0.35118
3,-1.030061,-0.645087,0.918538,-1.598790,-0.599986,0.647835,-0.924320,-0.35118
4,1.770320,0.844226,0.918538,0.625473,-0.599986,0.138621,-0.924320,-0.35118

# THANK YOU

 #          -----------  By Md Tanzeem  ----------